"""Постоянные константы"""

DEFAULT_COLOR = '#ffd057'
FILE_NAME = 'shopping_cart.txt'
DIRICTORY_PATH = 'recipe_img/'
MIN_INGREDIENT = 'Время приготовления не может быть меньше 1'
MAX_INGREDIENT = 'Количество ингредиентов не может быть больше 1000'
MIN_TIME_COOK = 'Время приготовления не может быть меньше 1'
MAX_TIME_COOK = 'Время приготовления не может быть больше 360'

INGREDIENT_UNITS = (
    ('г', 'граммы'),
    ('стакан', 'стакан'),
    ('по вкусу', 'по вкусу'),
    ('ст. л.', 'столовая ложка'),
    ('шт.', 'штука'),
    ('мл', 'миллилитры'),
    ('кг', 'килограммы'),
    ('л', 'литры'),
    ('ч. л.', 'чайная ложка'),
    ('банка', 'банка'),
    ('пакетик', 'пакетик'),
    ('пучок', 'пучок'),
    ('лист', 'лист'),
    ('зубчик', 'зубчик'),
    ('бутылка', 'бутылка'),
    ('пакет', 'пакет'),
    ('головка', 'головка'),
    ('корень', 'корень'),
    ('брусок', 'брусок'),
    ('кусочек', 'кусочек'),
    ('щепотка', 'щепотка'),
    ('брусочек', 'брусочек'),
    ('долька', 'долька'),
    ('чашка', 'чашка'),
    ('стебель', 'стебель'),
    ('пластинка', 'пластинка'),
    ('крошка', 'крошка'),
    ('кисточка', 'кисточка'),
)
